# -*- coding: utf-8 -*-
# @Time    : 2024/8/15 14:34
# @Author  : Zhang Huan
# @Email   : johnhuan@whu.edu.cn
# QQ       : 248404941
# @File    : demo_test.py
import pandas as pd
import shapefile


# from flask import Flask, render_template, jsonify
# from flask_restful import Api, Resource


def test_data_handler():
    _data1 = {"codes": 0,
              "count": 37,
              "info": "武汉市环卫工作站",
              "address": ["武汉市洪山区南湖大道与沿湖东路交叉口西380米", "武汉市洪山区南湖大道与沿湖东路交叉口西381米", "武汉市洪山区南湖大道与沿湖东路交叉口西382米",
                          "武汉市洪山区南湖大道与沿湖东路交叉口西383米", "武汉市洪山区南湖大道与沿湖东路交叉口西384米", "武汉市洪山区南湖大道与沿湖东路交叉口西385米",
                          "武汉市洪山区南湖大道与沿湖东路交叉口西386米", "武汉市洪山区南湖大道与沿湖东路交叉口西387米", "武汉市洪山区南湖大道与沿湖东路交叉口西388米",
                          "武汉市洪山区南湖大道与沿湖东路交叉口西389米", "武汉市洪山区南湖大道与沿湖东路交叉口西390米", "武汉市洪山区南湖大道与沿湖东路交叉口西391米",
                          "武汉市洪山区南湖大道与沿湖东路交叉口西392米", "武汉市洪山区南湖大道与沿湖东路交叉口西393米", "武汉市洪山区南湖大道与沿湖东路交叉口西394米",
                          "武汉市洪山区南湖大道与沿湖东路交叉口西395米", "武汉市洪山区南湖大道与沿湖东路交叉口西396米", "武汉市洪山区南湖大道与沿湖东路交叉口西397米",
                          "武汉市洪山区南湖大道与沿湖东路交叉口西398米", "武汉市洪山区南湖大道与沿湖东路交叉口西399米", "武汉市洪山区南湖大道与沿湖东路交叉口西400米",
                          "武汉市洪山区南湖大道与沿湖东路交叉口西401米", "武汉市洪山区南湖大道与沿湖东路交叉口西402米", "武汉市洪山区南湖大道与沿湖东路交叉口西403米",
                          "武汉市洪山区南湖大道与沿湖东路交叉口西404米", "武汉市洪山区南湖大道与沿湖东路交叉口西405米", "武汉市洪山区南湖大道与沿湖东路交叉口西406米",
                          "武汉市洪山区南湖大道与沿湖东路交叉口西407米", "武汉市洪山区南湖大道与沿湖东路交叉口西408米", "武汉市洪山区南湖大道与沿湖东路交叉口西409米",
                          "武汉市洪山区南湖大道与沿湖东路交叉口西410米", "武汉市洪山区南湖大道与沿湖东路交叉口西411米", "武汉市洪山区南湖大道与沿湖东路交叉口西412米",
                          "武汉市洪山区南湖大道与沿湖东路交叉口西413米", "武汉市洪山区南湖大道与沿湖东路交叉口西414米", "武汉市洪山区南湖大道与沿湖东路交叉口西415米",
                          "武汉市洪山区南湖大道与沿湖东路交叉口西416米"],
              "loc": ["[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]",
                      "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]",
                      "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]",
                      "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]",
                      "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]",
                      "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]",
                      "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]",
                      "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]",
                      "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]",
                      "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]",
                      "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]",
                      "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]", "[123.3123123, 34.1231232]",
                      "[123.3123123, 34.1231232]",
                      ],
              "names": ["环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站",
                        "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站",
                        "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站",
                        "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站"]}
    _data2 = {"info": "武汉市环卫工作站",
              "address": ["积玉路与友谊大道交叉口西北40米", "南湖大道与沿湖东路交叉口西380米", "北湖路2号(取水楼地铁站K口步行280米)", "陡埠大道与建国路交叉口东160米",
                          "宝丰街25附1号(崇仁路地铁站C口步行330米)", "永安大道与洪闾街交叉口南60米", "新坳路与平江东路交叉口东北220米", "古田一路长云路",
                          "临空港大道与东吴大道交叉口北80米", "武昌火车站东广场(神洲租车隔壁)", "中南建筑设计院股份有限公司西南门西南50米", "水利路与青年路辅路交叉口西南100米",
                          "中北路辅路与公正路交叉口东20米", "假日乐园购物广场西1门南70米", "杨园街街道(杨园铁四院地铁站B口步行130米)", "丽岛柳园北区西门西90米",
                          "楚材小区12(司门口黄鹤楼地铁站A口步行250米)", "武珞路小区东北门旁(街道口地铁站A口步行270米)", "珞喻路辅路与卓刀泉南路交叉口西60米",
                          "华中师大一附中初中部西南门旁(杨家湾地铁站D口旁)", "武汉理工大学马房山校区西院逸夫楼东南门南100米", "卓刀泉南路25(虎泉地铁站D口步行460米)",
                          "升升学生公寓南门东南140米", "华中师范大学南湖校区西北门旁", "武汉理工大学经济学院1号门旁", "民权路37号汇江大厦F1层", "鄂州街10号", "古田四路177号",
                          "二十四街坊59门", "幸福潮北万家都汇东南1门旁", "建一综合市场东南1门西南70米", "湖边坊路53号(苗栗路地铁站B口步行440米)", "新建后街长江委上滑坡小区",
                          "积玉路与前进路交叉口南20米", "泰宁街23附2(循礼门地铁站H口步行140米)", "高雄路49号附1号", "民权路1附近", "前进五路(循礼门地铁站C口步行280米)",
                          "渣家路与江汉北路交叉口北20米", "前进四路与京汉大道交叉口东南140米", "水果湖街办事处中北路222号", "东亭花园东北2门西北170米",
                          "罗家港路与团结大道交叉口西北40米",
                          "民族街办事处统一街35号2楼", "祥丰路原建一南路", "常青一路与新湾二路交叉口东100米", "新坳路与平江东路交叉口东北260米", "谭鑫培路", "建设大道415号",
                          "常青街街道常青街", "二七横路东新熙园", "杨园南路与欢乐大道交叉口南20米", "友谊路与京汉大道交叉口东南40米(友谊路地铁站A口旁)", "金才道滠口村", "焦沙路",
                          "谌家矶大道44附6号附近", "谌家矶大道44-2号附近", "工人村路与金嘴街交叉口东南300米", "工人村路与金嘴街交叉口东南320米", "阳逻经济开发区红岗一路1号",
                          "梧桐二里114", "工人村路与冶金大道交叉口东北20米", "石阳街与日晖里交叉口西南160米", "工业路与恩施街交叉口东北40米", "白玉山4街61门",
                          "解放大道辅路与百步亭路交叉口西南120米", "石灰堰与紫湖村路交叉口东120米", "建安街与巡司河西路交叉口西40米", "汉中西路17-9号", "汉中街道汉正街385号2栋",
                          "江南村东门旁", "南李路与武南路交叉口西北40米", "界兴路与唐涂路交叉口东南240米", "张辛路与汉宜路交叉口西北20米", "兴工九路与革新大道交叉口西60米",
                          "高桥五路与田园街交叉口北20米", "田园大道武汉吉人不锈钢大市场", "金北一路与鑫海路交叉口西南40米", "祁家山路与吴祁街交叉口西南120米",
                          "河露街与110省道交叉口西420米",
                          "长丰大道19号", "永丰派出所陈家咀社区警务室附近", "汉阳大道北侧", "纱帽街月亮湾路169号", "百花街与薇湖路交叉口西南40米", "武汉东湖新技术开发区龙泉街道办事处",
                          "流芳市容环卫所(高新大道南)", "双柳街卫生院西南侧290米", "雁中路与落雁路交叉口西北20米", "邾城街道邾城街24号附12号", "丰山路与巨龙大道交叉口西南100米",
                          "武汉奥林匹克花园东门西南260米", "天安道与育才街交叉口西40米", "将军新村3期西南门西北70米", "常青花园学府侧路(老年公寓旁)", "古田一路东风村特1号",
                          "三秀路3号",
                          "奓胜路11号", "振兴街2号", "玉贤街道车岭街", "东荆街15号", "中原大道与明理路交叉口南420米", "汉阳大道吉祥欧式花园(王家湾地铁站K口步行440米)",
                          "丰美路华生汉口城市广场南区", "后湖大道塔子湖体育中心", "唐家墩路1号-附1号"],
              "loc": [[114.316688, 30.565224], [114.366984, 30.480209], [114.274539, 30.599617], [114.06539, 30.299457],
                      [114.262127, 30.577128], [114.808371, 30.841173], [114.584175, 30.650394],
                      [114.184092, 30.609452],
                      [114.136858, 30.624661], [114.31567, 30.528254], [114.332985, 30.540158], [114.262444, 30.597028],
                      [114.341725, 30.554148], [114.299598, 30.546406], [114.344615, 30.600833],
                      [114.338035, 30.508487],
                      [114.303837, 30.546019], [114.349685, 30.527408], [114.368762, 30.519118],
                      [114.382203, 30.505373],
                      [114.350966, 30.521454], [114.36847, 30.516438], [114.343501, 30.503318], [114.358413, 30.509901],
                      [114.345906, 30.514908], [114.293158, 30.570087], [114.397513, 30.628454],
                      [114.215387, 30.600082],
                      [114.396271, 30.635492], [114.267004, 30.626853], [114.3729, 30.617499], [114.293355, 30.601402],
                      [114.306785, 30.616549], [114.313193, 30.561848], [114.28852, 30.585276], [114.286217, 30.596048],
                      [114.292821, 30.571357], [114.284959, 30.582774], [114.283889, 30.586952],
                      [114.284284, 30.582206],
                      [114.360684, 30.571396], [114.365403, 30.571149], [114.371122, 30.596849],
                      [114.286414, 30.569226],
                      [114.384256, 30.610621], [114.250086, 30.620703], [114.584552, 30.650541],
                      [114.331337, 30.368254],
                      [114.248877, 30.584099], [114.24269, 30.614648], [114.318923, 30.632586], [114.365522, 30.580819],
                      [114.278095, 30.580426], [114.349573, 30.714547], [114.482747, 30.662375],
                      [114.373297, 30.677283],
                      [114.373295, 30.677167], [114.427893, 30.64943], [114.428024, 30.64938], [114.571355, 30.708085],
                      [114.378389, 30.862914], [114.4258, 30.627169], [114.369565, 30.867621], [114.387562, 30.621484],
                      [114.481723, 30.610715], [114.32965, 30.643198], [114.303113, 30.527145], [114.307588, 30.504595],
                      [114.252662, 30.567562], [114.272553, 30.573156], [114.320398, 30.496057],
                      [114.313021, 30.476172],
                      [114.405916, 30.335267], [113.977702, 30.740534], [114.00965, 30.659495], [114.069034, 30.628816],
                      [114.107505, 30.621521], [114.148104, 30.65032], [114.145532, 30.625123], [114.216073, 30.809154],
                      [114.171066, 30.613369], [114.158265, 30.550149], [114.180382, 30.564784],
                      [114.084734, 30.313996],
                      [114.081959, 30.306059], [114.539793, 30.388038], [114.46387, 30.480906], [114.646253, 30.583574],
                      [114.423624, 30.58142], [114.796931, 30.846984], [114.242085, 30.717441], [114.212267, 30.66858],
                      [114.226374, 30.799721], [114.251696, 30.653682], [114.236911, 30.634516],
                      [114.183752, 30.609636],
                      [114.146049, 30.610042], [114.009467, 30.450607], [113.989428, 30.300462], [113.98726, 30.522676],
                      [113.918009, 30.343186], [114.387037, 30.46861], [114.214493, 30.560845], [114.214445, 30.595733],
                      [114.288159, 30.642264], [114.292295, 30.621835]],
              "name": ["环卫工作站", "环卫工作站", "北湖街环境卫生管理所", "纱帽街环卫工作站", "宝丰街环境卫生管理所", "环卫工作站", "武汉市新洲区阳逻环境卫生管理所",
                       "古田街环境卫生管理所",
                       "环卫工作站", "武昌区城市管理局环卫工作站(中山路辅路)", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站",
                       "武昌区人民政府中华路街环卫所", "环卫工作充电站", "环卫工作充电站", "环卫工作充电站", "环卫工作充电站", "环卫工作充电站", "环卫工作充电站", "环卫工作充电站",
                       "环卫工作充电站", "江汉环卫", "青山区冶金街环境卫生管理所", "韩家墩街环境卫生管理所", "新沟桥街环境卫生管理所", "汉兴街环境卫生管理所",
                       "武汉市青山区钢花村街环境卫生管理所",
                       "江岸区城市管理局劳动环境卫生管理所", "环卫工作站", "积玉桥街城管环卫工作点", "大智环境卫生管理所", "江岸区城市管理局西马环境卫生管理所", "环卫工作间",
                       "花楼水塔街环境卫生管理所", "环卫工作站", "环卫作业设备仓库", "东亭环卫所", "水果湖街环卫工作点", "环卫工作间", "民族环卫所", "武汉市和平乡环卫所",
                       "环卫工作站",
                       "阳逻环卫", "江夏区市容环境卫生服务中心", "硚口区市容环境卫生管理局固体废弃物管理站", "常青街环境卫生管理所", "环卫工人作息间", "环卫工作间", "环卫工作站",
                       "滠口街市容环境卫生管理所", "武汉市洪山区建设乡环卫所", "谌家矶街环境卫生服务管理所", "谌家矶街环境卫生管理所", "青山区工人村街环境卫生管理所",
                       "青山区工人街村环境卫生管理所",
                       "武汉阳逻经济开发区环卫基地", "黄陂区前川环境卫生清运所", "武汉市青山区厂前街环境卫生管理所", "武汉市黄陂区环境卫生清扫所", "环卫工作站", "青山区白玉山街环境卫生管理所",
                       "环卫工作站", "环卫工作站", "环卫工作站", "武汉市硚口区汉中街环卫所", "武圣花园环卫所", "环卫工作站", "狮子山环卫工作站", "五里界街环境卫生管理所",
                       "环卫工作站",
                       "环卫工作站", "环卫工作站", "环卫工作站", "环卫工作站", "文家塆居委会环卫站", "城管环卫综合服务岗亭", "易家街环境卫生管理所", "陈家咀社区环卫工作站",
                       "环卫工作站",
                       "汉南区城管(执法)局月亮湾环卫所", "武汉市汉南区纱帽街环卫所", "江夏区流芳街市容环卫服务中心", "武汉市江夏区流芳市容环卫所", "新洲双柳街环卫所", "环卫工作站",
                       "新洲区邾城街道环卫所(化乐路)工会户外职工爱心驿站", "城管环卫综合服务岗亭", "环卫工作站", "天河街环境卫生管理所", "环卫工作站", "环卫工作站",
                       "武汉市硚口区易家墩街环卫所",
                       "长青街市容环境卫生管理所", "奓山街市容环境卫生服务中心", "武汉市汉南区邓南街环卫所", "蔡甸区玉贤镇市容环卫服务中心", "武汉市汉南区东城垸农场环卫所",
                       "中南财经政法大学绿化环卫服务中心后勤保障部苗圃基地", "琴断口城管所环卫工作点", "环卫工作站", "环卫工作站", "环卫工作站"]}
    _data = {"info": "武汉市消防站数据",
             "name": ["武汉市武昌区积玉桥消防救援站", "湖北省消防救援总队", "武汉市洪山区消防救援大队", "武汉市武昌区中山路消防救援站", "武汉市洪山区武珞路消防救援站",
                      "武汉经济技术开发区全力消防救援站", "武汉市东西湖区新桥消防救援站", "武汉市江岸区消防救援大队", "武汉市洪山区南湖消防救援站", "武汉市消防救援支队",
                      "武汉市消防救援支队重型机械工程救援大队", "武汉市江汉区青年路消防救援站", "武汉市东西湖区粤创消防救援站", "武汉市东西湖区常青消防救援站", "武汉市东西湖区苗湖消防救援站",
                      "武汉市江汉区江汉路消防救援站", "武汉市武昌区罗家路特勤消防救援站", "武汉东湖新技术开发区流芳消防救援站", "武汉市江岸区永清街消防救援站", "武汉市消防救援支队径河消防救援站",
                      "武商专职消防救援站", "武汉市汉阳区芳华专职消防救援站", "武汉市徐东消防中队", "武汉市消防支队淌湖消防站", "新桥消防站", "武汉市消防支队汉兴小型消防站",
                      "江汉大队汉兴街专职消防救援站", "汉阳消防救援大队龙阳专职消防救援站", "武汉经济技术开发区沌口消防救援站", "积玉桥消防救援站", "武汉市汉阳区七里庙消防救援站",
                      "武汉市洪山区黄家湖消防救援站", "武汉市青山区武丰消防救援站", "武汉市江夏区大花岭专职消防救援站", "武汉市硚口区张毕湖专职消防救援站", "武汉市武昌区中山路消防救援站",
                      "武汉市洪山区烽火消防救援站", "武汉市江汉区青年路消防救援站", "武汉市江汉区天门墩消防救援站", "武汉市江汉区华安里专职消防救援站", "武汉市江汉区红光专职消防救援站",
                      "武汉市江汉区贺家墩专职消防救援站", "武汉市江汉区泛海消防救援站", "武汉市江汉区越秀专职消防救援站", "武商专职消防救援站", "武汉市江汉区黄陂街专职消防救援站",
                      "江汉大队汉兴专职消防救援站", "万松园消防救援站", "武汉市消防救援支队特勤大队二站", "武汉市汉阳区七里庙消防救援站", "武汉市武昌区积玉桥消防救援站",
                      "武汉市江岸区二七路消防救援站",
                      "武汉市硚口区长丰消防救援站", "武汉市东西湖区常青消防救援站", "武汉市硚口区古田消防救援站", "武汉市硚口区古田消防救援站", "武汉市武昌区中山路消防救援站",
                      "武汉市硚口区宗关消防救援站", "武汉市汉阳区永丰专职消防救援站", "武汉市江岸区车站专职消防救援站", "武汉市汉阳区墨水湖消防救援站", "武汉市硚口区宝丰路消防救援站",
                      "武汉市武昌区户部巷专职消防救援站", "武汉市青山区武丰消防救援站", "武汉市汉阳区黄金口消防救援站", "武汉市汉阳区凤举路专职消防救援站", "武汉市汉阳区惠民苑专职消防救援站",
                      "武汉市汉阳区晴川消防救援站", "武汉市汉阳区芳草消防救援站", "武汉市江岸区永清街消防救援站", "武汉市洪山区张家湾专职消防救援站", "武汉市硚口区汉正街消防救援站",
                      "武汉市洪山区南湖消防救援站", "武汉市青山区红钢城消防救援站", "武汉市武昌区徐家棚专职消防救援站", "武汉市黄陂区汉口北消防救援站",
                      "武汉市蔡甸区大集街道泊龙路新兰商业广场消防救援站",
                      "武汉市武昌区徐家棚专职消防救援站", "武汉市江汉区满春街道满春街小夹社区武汉消防", "武汉市洪山区梨园街道紫金苑徐东消防", "湖北省武汉市江岸区后湖街道武汉市江岸区淌湖专职消防站",
                      "武汉市桥口区宝丰路消防救援站", "武汉市洪山区和平街道洪山消防", "湖北省武汉市汉阳区建桥街道晴川消防", "湖北省武汉市汉阳区建桥街道汉阳消防", "武汉市大集消防救援站",
                      "武汉市江夏区栗庙专职消防救援站", "武汉市武昌区水果湖消防救援站", "武汉市黄陂区横店消防救援站", "武汉市洪山区徐东路消防救援站", "武汉市洪山区南湖消防救援站-西门",
                      "武汉市江夏区大花岭专职消防救援站", "武汉市消防救援支队径河消防救援站", "武汉市洪山区武珞路消防救援站", "武汉市消防救援支队湖滨消防救援站", "武汉市汉阳区四台专职消防救援站",
                      "武汉市汉南区兴一路消防救援站", "武汉市江夏区安山消防救援站", "武汉市江夏区麻雀湖消防救援站", "武汉市江岸区百步亭消防救援站", "武汉市洪山区白沙洲消防救援站",
                      "武汉市青山区工人村消防救援站", "武汉市汉阳消防救援大队", "武汉市黄陂区武湖特勤消防救援站", "武汉市黄陂区前川消防救援站", "黄坡消防", "武汉市黄坡消防救援大队",
                      "武汉市汉阳区七里庙消防救援站-西北门", "武汉市武昌大队白沙洲专职消防救援站", "武汉市洪山区黄家湖消防救援站", "武汉市新洲区永安大道消防救援站",
                      "武汉市公安消防支队洪山区大队八一路中队", "武汉市江夏区金港特勤消防救援站", "武汉市东湖生态旅游风景区八一路消防救援站", "武汉市洪山区晒湖消防救援站",
                      "武汉市东西湖区新桥消防救援站",
                      "武汉市青山区青山镇专职消防救援站", "武汉市江夏区八分山专职消防救援站", "武汉市青山区武东专职消防救援站", "武汉经济技术开发区消防救援大队", "武汉经济技术开发区沌口消防救援站",
                      "武汉市武昌区中山路消防救援站-西南门", "东湖生态旅游风景区磨山消防救援站", "流芳消防救援站", "汉阳消防救援大队龙阳专职消防救援站", "武汉市武昌区梅苑政府专职小型消防救援站",
                      "武汉市经济技术开发区体育中心专职消防救援站", "二七路消防救援站", "武汉市洪山区建和消防救援站", "武汉市东西湖区消防救援大队", "武汉市消防救援支队南湖培训鉴定站",
                      "武汉市东西湖区三店消防救援站", "武汉市硚口区汉正街消防救援站", "武汉市硚口区宗关消防救援站", "武汉市洪山区南湖消防救援站", "武汉市江汉区天门墩消防救援站",
                      "武汉市消防救援支队舵落口战勤保障站", "吴家山消防救援站", "武汉市硚口区古田消防救援站", "武汉市东西湖区常青消防救援站", "武汉市消防救援支队", "武汉市武昌区水果湖消防救援站",
                      "武汉市江岸区永清街消防救援站", "武汉市汉阳区七里庙消防救援站", "武汉市汉阳区芳草消防救援站", "武汉市武昌区中山路消防救援站", "武汉市硚口区消防救援大队", "武汉消防",
                      "汉阳消防救援大队龙阳专职消防救援站", "武汉市汉阳区消防救援大队", "武汉消防站"],
             "loc": [[114.309403, 30.563132], [114.327092, 30.553964], [114.367044, 30.50141], [114.305529, 30.521264],
                     [114.33326, 30.533635], [114.097263, 30.458598], [114.163549, 30.635488], [114.335535, 30.65541],
                     [114.331103, 30.497668], [114.261404, 30.632587], [114.0891, 30.443493], [114.26035, 30.612958],
                     [114.222683, 30.668174], [114.235932, 30.635473], [113.98692, 30.679412], [114.289686, 30.579324],
                     [114.358572, 30.612043], [114.358572, 30.612043], [114.305519, 30.607555], [114.158921, 30.684308],
                     [114.272973, 30.580084], [114.198777, 30.550265], [114.354029, 30.586696], [114.305032, 30.637585],
                     [114.282717, 30.568091], [114.232878, 30.618374], [114.233062, 30.618332], [114.190212, 30.538582],
                     [114.173546, 30.473835], [114.330425, 30.574985], [114.225524, 30.561297], [114.26692, 30.417035],
                     [114.377455, 30.607268], [114.334571, 30.368663], [114.171473, 30.621807], [114.305501, 30.521255],
                     [114.137434, 30.608342], [114.260324, 30.612939], [114.280472, 30.605753], [114.241619, 30.61736],
                     [114.248114, 30.630934], [114.330425, 30.574985], [114.242056, 30.601855], [114.278092, 30.585639],
                     [114.282646, 30.568294], [114.292953, 30.57241], [114.256507, 30.627971], [114.282646, 30.568294],
                     [114.263831, 30.589698], [114.261191, 30.63161], [114.225524, 30.561297], [114.293366, 30.625674],
                     [114.202839, 30.611642], [114.235968, 30.635511], [114.203472, 30.592543], [114.203472, 30.592543],
                     [114.305501, 30.521255], [114.224387, 30.579561], [114.198777, 30.550265], [114.303535, 30.638278],
                     [114.245416, 30.530154], [114.250995, 30.577975], [114.333241, 30.533657], [114.377455, 30.607268],
                     [114.146128, 30.564498], [114.22212, 30.530664], [114.169611, 30.585649], [114.198777, 30.550265],
                     [114.273287, 30.547414], [114.27338, 0.547456], [114.198172, 30.52105], [114.305519, 30.607555],
                     [114.331078, 30.49766], [114.401564, 30.64531], [114.330425, 30.574985], [114.331213, 30.70813],
                     [114.055993, 30.504137], [114.330425, 30.574985], [114.282789, 30.56785], [114.353985, 30.586699],
                     [114.303673, 30.638167], [114.251006, 30.577989], [114.375135, 30.598243], [114.27338, 30.547467],
                     [114.27329, 30.547428], [114.055993, 30.504137], [114.425382, 30.397198], [114.343528, 30.552597],
                     [114.268065, 30.768639], [114.353997, 30.586722], [114.331078, 30.49766], [114.334571, 30.368663],
                     [114.317216, 30.335935], [114.308724, 30.410459], [114.158921, 30.684308], [114.261428, 30.632573],
                     [114.333289, 30.533613], [114.142079, 30.513934], [114.148018, 30.578903], [114.198777, 30.550265],
                     [114.273287, 30.547414], [114.087511, 30.321407], [114.296821, 30.146402], [114.379128, 30.88805],
                     [114.378907, 30.888028], [114.378907, 30.888028], [114.379791, 30.887984], [114.225524, 30.561297],
                     [114.286403, 30.514051], [114.281238, 30.444347], [114.807948, 30.83694], [114.372736, 30.528272],
                     [114.169323, 30.377327], [114.372658, 30.528509], [114.325843, 30.513308], [114.163637, 30.635426],
                     [114.429184, 30.654469], [114.317216, 30.335935], [114.46379, 30.583023], [114.17388, 30.473728],
                     [114.173546, 30.473835], [114.305501, 30.521255], [114.411616, 30.525333], [114.411233, 30.525319],
                     [114.190212, 30.538582], [114.32668, 30.529923], [114.171015, 30.501426], [114.292449, 30.625075],
                     [114.250198, 30.463679], [114.149234, 30.648682], [114.313742, 30.501351], [114.119579, 30.621571],
                     [114.264922, 30.566409], [114.224877, 30.57885], [114.331951, 30.498092], [114.280983, 30.606351],
                     [114.17543, 30.60834], [114.138364, 30.607875], [114.202672, 30.593433], [114.236712, 30.634875],
                     [114.261452, 30.632139], [114.344685, 30.553537], [114.306206, 30.608253], [114.226351, 30.562078],
                     [114.198996, 30.520695], [114.30463, 30.52083], [114.225166, 30.578636], [114.332478, 30.533201],
                     [114.198201, 30.550567], [114.22531, 30.560411], [114.283116, 30.567432]]}
    data = []
    l = len(_data['name'])
    print(l)
    for i in range(1, l):
        data.append({
            "id": i,
            "loc": _data["loc"][i],
            "names": _data["name"][i]
        })
    print(data)


def demo():
    data_path = '/codes/portal/data/'
    df = pd.read_excel(data_path + 'fire_fightings.xlsx', usecols=["名称", "经度", "纬度"])
    # pd.read_excel(data_path + 'sanitations.xlsx', usecols=["地址", "名称", "经度", "纬度"])
    data = []
    for i, r in df.iterrows():
        data.append({
            "id": i + 1,
            'names': r['名称'],
            'loc': [r['经度'], r['纬度']]
        })
    print(data)


# from geopandas.io.file import _read_file as read_file
# from shapely.geometry import Point
import numpy as np

if __name__ == '__main__':
    # path = r'D:\Research\Sanitation\assessment\result\valuation_result.shp'
    path = r'/result/polygons/target.shp'
    spr = shapefile.Reader(path)
    fields = []
    f = spr.fields[1:]
    for field in f:
        fields.append(str(field[0]))
    fields.append('boundary')  # 添加边界属性
    df = pd.DataFrame(columns=fields)
    for r in range(0, spr.numRecords):
        row = spr.record(r)
        row.append(spr.shape(r).points)
        df.loc[r] = row
    gdf = df
    parts = len(gdf)
    S1 = gdf.S1.values  # S1 值  可达性
    S = gdf.S.values  # S 值 消防供给
    C = gdf.C.values  # C 值 消防设施匹配度
    N = gdf.N.values  # N 值 消防需求
    n1 = gdf.N1.values  # N1 值 人口密度
    N2 = gdf.N2.values  # N2 值 建筑密度
    far = gdf.FAR.values  # FAR 值
    pop = gdf.POP.values  # POP 值
    Area = gdf.POP.values  # Area 值
    n_dLMC = gdf.N_DLMC.values  # N_DLMC 值
    risk = gdf.Risk.values  # Risk 值
    ca_per = gdf.CA_Per.values  # CA_per 值
    nS1 = gdf.nS1.values  # nS1 值
    S21 = gdf.S21.values  # S21 值
    S22 = gdf.S22.values  # S22 值
    S23 = gdf.S23.values  # S23 值
    nS21 = gdf.nS21.values  # Sn21 值
    nS22 = gdf.nS22.values  # Sn22 值
    nS23 = gdf.nS23.values  # Sn23 值
    nS2 = gdf.nS2.values  # Sn2 值
    nN1 = gdf.nN1.values  # nN1 值
    nN2 = gdf.nN2.values  # nN2 值
    S_ = gdf.S_.values  # S 值
    N_ = gdf.N_.values  # N 值
    C_ = gdf.C_.values  # C 值
    S11_ = gdf.S11_.values  # C 值
    nS11_ = gdf.nS11_.values  # C 值
    S12_ = gdf.S12_.values  # C 值
